Revit 2027 API
RuledSurface.HasFirstProfilePoint Method
 Checks if a point was used to define the first profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasFirstProfilePoint()
Public Function HasFirstProfilePoint As Boolean
public:
bool HasFirstProfilePoint()
member HasFirstProfilePoint : unit -> bool
Return Value
Boolean
 True if a point was used to define the first profile, false otherwise.
See Also
Reference
RuledSurface Class
Autodesk.Revit.DB Namespace